src/InformationRegisters/ЦеныПоставщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЦеныПоставщиков</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/Скидки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Скидки</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Скидка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>НоменклатураНоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonModules/ЦеныСервер/Ext/Module.bsl
Функция ЦенаНаДату(Номенклатура, Дата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	СУММА(ЦеныПоставщиковСрезПоследних.Цена) КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныПоставщиков.СрезПоследних(&Дата, &Номенклатура = Номенклатура) КАК ЦеныПоставщиковСрезПоследних";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Цена = 0;
	
	Пока Выборка.Следующий() Цикл
		Цена = Выборка.Цена;
	КонецЦикла;
	
	Возврат Цена;
	
КонецФункции

Функция СкидкаНаДату(Знач Номенклатура, Дата) Экспорт
	
	Скидка = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	СкидкиСрезПоследних.Скидка КАК Скидка
		|ИЗ
		|	РегистрСведений.Скидки.СрезПоследних(&Дата, НоменклатураНоменклатурнаяГруппа = &Номенклатура) КАК СкидкиСрезПоследних";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	ПустойЗапрос = РезультатЗапроса.Пустой();
	
	Если ПустойЗапрос И ТипЗнч(Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
		Номенклатура = Номенклатура.НоменклатурнаяГруппа;
		Скидка = СкидкаНаДату(Номенклатура, Дата);
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Скидка = Выборка.Скидка;
	КонецЦикла;
	
	Возврат Скидка;
	
КонецФункции

Функция РасчётЦены(Знач Сумма, Знач Количество) Экспорт
	
	Результат = 0;
	
	Если ЗначениеЗаполнено(Количество) Тогда
		Результат = Окр(Сумма / Количество, 2, РежимОкругления.Окр15как10);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция РасчётСуммы(Знач Сумма, Знач Скидка) Экспорт
	
	Результат = Сумма;
	
	Если ЗначениеЗаполнено(Скидка) Тогда
		Результат = Сумма - Сумма * (Скидка / 100);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
